#' этапы развития человека
# основные этапы эволюции человека: 
#дриопитек – рамапитек – австралопитек – человек умелый – 
#человек прямоходящий – неандертальский человек (палеоантроп) – 
#неоантроп (это уже человек современного типа, homo sapiens).

a1 = input("Введите этап 1: ")
a2 = input("Введите этап 2: ")
a3 = input("Введите этап 3: ")
a4 = input("Введите этап 4: ")
a5 = input("Введите этап 5: ")
a6 = input("Введите этап 6: ")
a7 = input("Введите этап 7: ")

print ('Этапы развития человека')
print (a1, a2, a3, a4, a5, a6, a7, sep='=>')